<?php
/**
 * Created by PhpStorm.
 * User: sergs
 * Date: 20.03.2018
 * Time: 13:11
 */

use Illuminate\Database\Seeder;

class TestPageSeeder extends Seeder
{
	/**
	 * Run the database seeds.
	 *
	 * @return void
	 */
	public function run()
	{
		DB::table('static_pages')->insert(
			[
				'id'          => 9,
				'title_ru'       => 'тест',
				'longtitle_ru'   => 'Первый тест',
				'description_ru' => '{"description_ru":"<div>Тут всё просто. Можно проигнорировать, а можно оценить свой личный риск инфицироваться ВИЧ - выбор за тобой. Каждое новое поколение умнее и свободнее предыдущего, а критическое мышление - один из самых важных навыков в мире будущего - убеждена команда Drugstore.<\/div><div>Чтобы оценить свой личный риск инфицироваться ВИЧ, необходимо пройти короткий тест:<\/div>\r\n<ul class=\"list\">\r\n<li>отвечай быстро, не задумываясь<\/li>\r\n<li>стоит ли говорить, что отвечать нужно честно<\/li>\r\n<li>выбери наиболее точные и подходящие для тебя ответы, и нажми «продолжить»<\/li>\r\n<\/ul>\r\n<div>Получай удовольствие с умом, <br> команда Drugstore<\/div>","test_btn_ru":"пройти тест","test_btn_next_ru":"далее","Quest_ru":[{"id":"0","label":"Ваш пол","user":"1","vars":[{"k":"М","v":"ММ","hint":""},{"k":"Ж","v":"ЖЖ","hint":""},{"k":"Трансгендер <div class=\'test-in\'>(человек, чья гендерная идентичность не совпадает с биологическим полом)<\/div>","v":"Трансгендер (человек, чья гендерная идентичность не совпадает с биологическим полом)","hint":""}]},{"id":"1","label":"Ваш возраст","user":"1","vars":[{"k":"до 14","v":"до 14","hint":""},{"k":"14-18","v":"14-18","hint":""},{"k":"19-24","v":"19-24","hint":""},{"k":"25 и старше","v":"25 и старше","hint":""}]},{"id":"2","label":"Сколько сексуальных партнеров у вас было за последние 6  месяцев?","vars":[{"k":"1","v":"M","hint":""},{"k":"2","v":"C","hint":""},{"k":"3 или больше","v":"B","hint":""},{"k":"Ни одного","v":"0","hint":""}]},{"id":"3","label":"Что вы употребляете перед сексом?","vars":[{"k":"Алкоголь","v":"C","hint":""},{"k":"Наркотики","v":"B","hint":"любые наркотики включая метамфетамин (фен), экстази или марихуану"},{"k":"Ни то, ни другое","v":"0","hint":""}]},{"id":"4","label":"Как вы употребляете наркотик?","vars":[{"k":"При помощи шприца","v":"B","hint":""},{"k":"Курю","v":"M","hint":""},{"k":"Глотаю","v":"C","hint":""},{"k":"Нюхаю","v":"C","hint":""},{"k":"Не употребляю наркотики","v":"0","hint":""}]},{"id":"5","label":"Был ли у вас секс без презерватива? <span>(можете отметить несколько вариантов)<\/span>","vars":[{"k":"Оральный секс без презерватива","v":"M","hint":""},{"k":"Вагинальный секс без презерватива","v":"B","hint":""},{"k":"Анальный секс без презерватива","v":"B","hint":""},{"k":"Секс без презерватива со случайным партнером","v":"B","hint":""},{"k":"Групповой секс без презерватива","v":"B","hint":""},{"k":"Не было","v":"0","hint":""}]},{"id":"6","label":"Можете ли вы по внешнему виду определить есть ли у человека ВИЧ?","vars":[{"k":"Да","v":"B","hint":""},{"k":"Нет","v":"0","hint":""}]},{"id":"7","label":"Употреблял ли кто-то из ваших сексуальных партнеров наркотики?","vars":[{"k":"Да","v":"B","hint":""},{"k":"Нет","v":"M","hint":""},{"k":"Не знаю","v":"C","hint":""},{"k":"Нет сексуальных партнеров","v":"0","hint":""}]},{"id":"8","label":"Сможете ли вы отказаться от секса со случайным партнером если нет презерватива?","vars":[{"k":"Смогу отказаться","v":"0","hint":""},{"k":"Не смогу отказаться","v":"B","hint":""}]},{"id":"9","label":"Был ли у вас секс с ВИЧ-инфицированным партнером?","vars":[{"k":"Да","v":"B","hint":""},{"k":"Нет","v":"0","hint":""},{"k":"Не знаю","v":"B","hint":""}]},{"id":"10","label":"Были ли у вас заболевания передающиеся половым путем?","vars":[{"k":"Да","v":"B","hint":""},{"k":"Нет","v":"0","hint":""}]},{"id":"11","label":"Тестировались ли вы на ВИЧ?","vars":[{"k":"Да","v":"0","hint":""},{"k":"Нет","v":"B","hint":""}]}],"Answer_ru":["нет риска, тестироваться не нужно","минимальный риск","средняя степень риска","высокий риск"]}',
				'page_index'  => 9,
				'published'   => 1,
				'alias'       => 'aids-test',
			]
		);
	}
}